app/views/albums/show.html.erb

	<ul class="row">
		<% @album.images.each do |photo| %>
---
SELECT "images".* FROM "images" WHERE "images"."album_id" = ?  [["album_id", 1]]