app/controllers/albums_controller.rb

  def index
       @images = []
     unless current_user
       Album.all.each{|al| @images << al.images.first }
    else
        @albums = current_user.albums.last(5).reverse

        @albums.all.each{|al| @images << al.images.first } if !@albums.blank?
---
SELECT  "images".* FROM "images" WHERE "images"."album_id" = ?  ORDER BY "images"."id" ASC LIMIT 1  [["album_id", 2]]
SELECT `albums`.* FROM `albums`
SELECT  `albums`.* FROM `albums` WHERE `albums`.`user_id` = 1  ORDER BY `albums`.`id` DESC LIMIT 5
SELECT "albums".* FROM "albums" WHERE "albums"."user_id" = ?  [["user_id", 5]]

  def create
    @album = Album.new(album_params)
    @album.user_id = current_user.id
    respond_to do |format|
      if @album.save
---
INSERT INTO "albums" ("album_name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["album_name", "yguyghuh"], ["user_id", 5], ["created_at", "2015-06-30 09:50:51.009826"], ["updated_at", "2015-06-30 09:50:51.009826"]]

  def destroy
    @album.destroy
---
DELETE FROM "albums" WHERE "albums"."id" = ?  [["id", 4]]

    def set_album
      @album = Album.find(params[:id])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT 1  [["id", 4]]