app/controllers/images_controller.rb

SELECT "images".* FROM "images"
---
  def index

       @images = Image.all

SELECT  "images".* FROM "images" WHERE "images"."album_id" = ? AND "images"."id" = ? LIMIT 1  [["album_id", 3], ["id", 7]]
---
  def show
    @image = @album.images.find params[:id]

INSERT INTO "images" ("tag_line", "avatar_file_name", "avatar_content_type", "avatar_file_size", "avatar_updated_at", "album_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @image = @album.images.new(image_params)
    @image.user_id = current_user.id
    @image.album = @album
    if @image.save

SELECT  "images".* FROM "images" WHERE "images"."album_id" = ? AND "images"."id" = ? LIMIT 1  [["album_id", 9], ["id", 27]]
---
  def edit
    @image = @album.images.find params[:id]

SELECT  "images".* FROM "images" WHERE "images"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "images" SET "avatar_file_name" = ?, "avatar_file_size" = ?, "avatar_updated_at" = ?, "updated_at" = ? WHERE "images"."id" = ?  [["avatar_file_name", "images_(1).jpg"], ["avatar_file_size", 7978], ["avatar_updated_at", "2015-06-27 11:04:28.952853"], ["updated_at", "2015-06-27 11:04:29.046922"], ["id", 1]]
---
  def update
    @image = @album.images.find params[:id]

    if @image.update_attributes params[:image]

DELETE FROM "images" WHERE "images"."id" = ?  [["id", 2]]
---
  def destroy
    @image.destroy

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT 1  [["id", 9]]
---
  def set_album
    @album = Album.find params[:album_id]

SELECT  "images".* FROM "images" WHERE "images"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_image
      @image = Image.find(params[:id])